Revit 2027 API
TaskDialog.Title Property
 Title of the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
public:
property String^ Title {
	String^ get ();
	void set (String^ value);
}
member Title : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when setting the value to null.
ArgumentException |  Thrown when setting the value to an empty string or string contains newline characters.
Remarks
 Titles of task dialogs should be unique. Do not reuse the same title for multiple task dialogs.
 Newline characters are not allowed in Title.
 When the dialogs is shown, Revit will put "External Command Name –" or "External Application –" in the front of the value by default. Examples:
 Plug-in Name – No Rooms to Calculate
 Plug-in Name – Invalid Value for Length
 You can suppress it by setting TitleAutoPrefix to false.
 Titles should describe the nature of the problem or state the situation that currently exists. The title tells the user why they are getting the message, not what they are supposed to do.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace